#include "ayplayer_fat_api.h"

//**********************************************************************
// Используемые глобальные объекты.
//**********************************************************************
FATFS                   fat;

// Пытаемся инициализировать карту (проверяем ее адекватность).
// 0                    - успех.
// ECONNREFUSED         - провал.
int system_card_chack ( void ) {
    DSTATUS r;
    for ( int l = 0; l < 5; l++) {      // Даем 5 попыток инициализировать карту.
        r = disk_initialize(0);
        if ( r == RES_OK ) {
            return 0;
        }
    }


    return ECONNREFUSED;
}
